
# tap repositories and their packages

tap 'homebrew/core'
brew 'abseil'
brew 'ada-url'
brew 'aom'
brew 'aribb24'
brew 'brotli'
brew 'byobu'
brew 'c-ares'
brew 'ca-certificates'
brew 'cairo'
brew 'certifi'
brew 'cjson'
brew 'coreutils'
brew 'dav1d'
brew 'ffmpeg'
brew 'fftw'
brew 'flac'
brew 'fmt'
brew 'fontconfig'
brew 'freetype'
brew 'frei0r'
brew 'fribidi'
brew 'gcc'
brew 'gdk-pixbuf'
brew 'gettext'
brew 'gh'
brew 'ghostscript'
brew 'giflib'
brew 'glib'
brew 'gmp'
brew 'gnutls'
brew 'gping'
brew 'graphite2'
brew 'harfbuzz'
brew 'hdrhistogram_c'
brew 'highway'
brew 'htop'
brew 'httping'
brew 'hwloc'
brew 'icu4c@77'
brew 'icu4c@78'
brew 'imagemagick'
brew 'imath'
brew 'isl'
brew 'jasper'
brew 'jbig2dec'
brew 'jpeg-turbo'
brew 'jpeg-xl'
brew 'krb5'
brew 'lame'
brew 'lazygit'
brew 'leptonica'
brew 'libarchive'
brew 'libass'
brew 'libb2'
brew 'libbluray'
brew 'libde265'
brew 'libdeflate'
brew 'libevent'
brew 'libheif'
brew 'libidn'
brew 'libidn2'
brew 'liblqr'
brew 'libmicrohttpd'
brew 'libmpc'
brew 'libnghttp2'
brew 'libnghttp3'
brew 'libngtcp2'
brew 'libogg'
brew 'libomp'
brew 'libpng'
brew 'libpq'
brew 'libraw'
brew 'librist'
brew 'librsvg'
brew 'libsamplerate'
brew 'libsndfile'
brew 'libsodium'
brew 'libsoxr'
brew 'libssh'
brew 'libtasn1'
brew 'libtiff'
brew 'libtool'
brew 'libudfread'
brew 'libultrahdr'
brew 'libunibreak'
brew 'libunistring'
brew 'libuv'
brew 'libvidstab'
brew 'libvmaf'
brew 'libvorbis'
brew 'libvpx'
brew 'libx11'
brew 'libxau'
brew 'libxcb'
brew 'libxdmcp'
brew 'libxext'
brew 'libxrender'
brew 'libzip'
brew 'little-cms2'
brew 'llhttp'
brew 'lz4'
brew 'lzo'
brew 'm4'
brew 'mas'
brew 'mbedtls@3'
brew 'mosh'
brew 'mpdecimal'
brew 'mpfr'
brew 'mpg123'
brew 'ncurses'
brew 'nettle'
brew 'newt'
brew 'node'
brew 'open-mpi'
brew 'opencore-amr'
brew 'openexr'
brew 'openjdk@11'
brew 'openjpeg'
brew 'openjph'
brew 'openssl@3'
brew 'opus'
brew 'p11-kit'
brew 'p7zip'
brew 'pango'
brew 'pcre2'
brew 'pipenv'
brew 'pipx'
brew 'pixman'
brew 'pmix'
brew 'popt'
brew 'protobuf'
brew 'python@3.12'
brew 'python@3.13'
brew 'python@3.14'
brew 'rav1e'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'rubberband'
brew 's-lang'
brew 'sdl2'
brew 'shared-mime-info'
brew 'simdjson'
brew 'snappy'
brew 'speex'
brew 'sqlite'
brew 'srt'
brew 'svt-av1'
brew 'tesseract'
brew 'testdisk'
brew 'theora'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'unbound'
brew 'utf8proc'
brew 'uv'
brew 'uvwasi'
brew 'webp'
brew 'x264'
brew 'x265'
brew 'xorgproto'
brew 'xvid'
brew 'xz'
brew 'zeromq'
brew 'zimg'
brew 'zsh-completions'
brew 'zstd'

tap 'homebrew/cask'
cask '1password'
cask 'android-file-transfer'
cask 'arc'
cask 'azookey'
cask 'balenaetcher'
cask 'bambu-studio'
cask 'beeper'
cask 'blackhole-16ch'
cask 'cad-assistant'
cask 'creality-print'
cask 'discord'
cask 'disk-drill'
cask 'font-biz-udgothic'
cask 'font-plemol-jp'
cask 'font-plemol-jp-hs'
cask 'font-udev-gothic'
cask 'freecad'
cask 'ghostty'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'google-drive'
cask 'google-japanese-ime'
cask 'handy'
cask 'inkscape'
cask 'karabiner-elements'
cask 'localsend'
cask 'miniforge'
cask 'notion-calendar'
cask 'obs'
cask 'obsidian'
cask 'orcaslicer'
cask 'podman-desktop'
cask 'raspberry-pi-imager'
cask 'raycast'
cask 'scroll-reverser'
cask 'slack'
cask 'synology-drive'
cask 'tailscale'
cask 'tomatobar'
cask 'visual-studio-code'
cask 'vivaldi'
cask 'vlc'
cask 'zoom'

tap 'oven-sh/bun'
brew 'bun'

tap 'rcmdnk/file'
brew 'brew-file'

# App Store applications
mas 'Canva (1.119.0)', id: 897446215
mas 'LINE (9.14.0)', id: 539883307
mas 'Microsoft Excel (16.104)', id: 462058435
mas 'Microsoft Word (16.104)', id: 462054704
mas 'Structured (4.4.0)', id: 1499198946
mas 'Trello (2.15.15)', id: 1278508951
