
# tap repositories and their packages

tap 'homebrew/core'
brew 'aom'
brew 'aribb24'
brew 'brotli'
brew 'c-ares'
brew 'ca-certificates'
brew 'cairo'
brew 'cjson'
brew 'dav1d'
brew 'expat'
brew 'ffmpeg'
brew 'flac'
brew 'fontconfig'
brew 'freetype'
brew 'frei0r'
brew 'fribidi'
brew 'gettext'
brew 'gh'
brew 'giflib'
brew 'glib'
brew 'gmp'
brew 'gnutls'
brew 'graphite2'
brew 'harfbuzz'
brew 'highway'
brew 'icu4c@77'
brew 'imath'
brew 'jpeg-turbo'
brew 'jpeg-xl'
brew 'lame'
brew 'leptonica'
brew 'libarchive'
brew 'libass'
brew 'libb2'
brew 'libbluray'
brew 'libdeflate'
brew 'libevent'
brew 'libidn2'
brew 'libmicrohttpd'
brew 'libnghttp2'
brew 'libogg'
brew 'libpng'
brew 'librist'
brew 'libsamplerate'
brew 'libsndfile'
brew 'libsodium'
brew 'libsoxr'
brew 'libssh'
brew 'libtasn1'
brew 'libtiff'
brew 'libunibreak'
brew 'libunistring'
brew 'libuv'
brew 'libvidstab'
brew 'libvmaf'
brew 'libvorbis'
brew 'libvpx'
brew 'libx11'
brew 'libxau'
brew 'libxcb'
brew 'libxdmcp'
brew 'libxext'
brew 'libxrender'
brew 'little-cms2'
brew 'lz4'
brew 'lzo'
brew 'mbedtls'
brew 'mpdecimal'
brew 'mpg123'
brew 'nettle'
brew 'node'
brew 'opencore-amr'
brew 'openexr'
brew 'openjpeg'
brew 'openssl@3'
brew 'opus'
brew 'p11-kit'
brew 'p7zip'
brew 'pango'
brew 'pcre2'
brew 'pipx'
brew 'pixman'
brew 'python@3.11'
brew 'python@3.12'
brew 'python@3.13'
brew 'rav1e'
brew 'readline'
brew 'rubberband'
brew 'sdl2'
brew 'snappy'
brew 'speex'
brew 'sqlite'
brew 'srt'
brew 'svt-av1'
brew 'tesseract'
brew 'theora'
brew 'unbound'
brew 'uv'
brew 'webp'
brew 'x264'
brew 'x265'
brew 'xorgproto'
brew 'xvid'
brew 'xz'
brew 'zeromq'
brew 'zimg'
brew 'zsh-completions'
brew 'zstd'

tap 'homebrew/cask'
cask '1password'
cask 'android-file-transfer'
cask 'balenaetcher'
cask 'bambu-studio'
cask 'bartender'
cask 'beeper'
cask 'cad-assistant'
cask 'chatgpt'
cask 'creality-print'
cask 'discord'
cask 'font-biz-udgothic'
cask 'font-plemol-jp'
cask 'freecad'
cask 'ghostty'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'google-drive'
cask 'inkscape'
cask 'karabiner-elements'
cask 'librecad'
cask 'localsend'
cask 'miniforge'
cask 'mu-editor'
cask 'obs'
cask 'raspberry-pi-imager'
cask 'raycast'
cask 'scroll-reverser'
cask 'synology-drive'
cask 'visual-studio-code'
cask 'vivaldi'
cask 'vlc'
cask 'zoom'

tap 'rcmdnk/file'
brew 'brew-file'
