
# tap repositories and their packages

tap 'homebrew/core'
brew 'act'
brew 'aom'
brew 'aribb24'
brew 'awscli'
brew 'brotli'
brew 'c-ares'
brew 'ca-certificates'
brew 'cairo'
brew 'cffi'
brew 'cjson'
brew 'cryptography'
brew 'dav1d'
brew 'ffmpeg'
brew 'firebase-cli'
brew 'flac'
brew 'flyctl'
brew 'fontconfig'
brew 'freetype'
brew 'frei0r'
brew 'fribidi'
brew 'gdbm'
brew 'gettext'
brew 'gh'
brew 'ghostscript'
brew 'giflib'
brew 'glib'
brew 'gmp'
brew 'gnutls'
brew 'gping'
brew 'graphite2'
brew 'harfbuzz'
brew 'highway'
brew 'httping'
brew 'imagemagick'
brew 'imath'
brew 'jasper'
brew 'jbig2dec'
brew 'jpeg-turbo'
brew 'jpeg-xl'
brew 'krb5'
brew 'lame'
brew 'leptonica'
brew 'libarchive'
brew 'libass'
brew 'libb2'
brew 'libbluray'
brew 'libde265'
brew 'libdeflate'
brew 'libevent'
brew 'libheif'
brew 'libidn'
brew 'libidn2'
brew 'liblqr'
brew 'libmicrohttpd'
brew 'libnghttp2'
brew 'libogg'
brew 'libomp'
brew 'libpng'
brew 'libraw'
brew 'librist'
brew 'libsamplerate'
brew 'libsndfile'
brew 'libsodium'
brew 'libsoxr'
brew 'libssh'
brew 'libtasn1'
brew 'libtiff'
brew 'libtool'
brew 'libunibreak'
brew 'libunistring'
brew 'libuv'
brew 'libvidstab'
brew 'libvmaf'
brew 'libvorbis'
brew 'libvpx'
brew 'libx11'
brew 'libxau'
brew 'libxcb'
brew 'libxdmcp'
brew 'libxext'
brew 'libxrender'
brew 'little-cms2'
brew 'lz4'
brew 'lzo'
brew 'm4'
brew 'mas'
brew 'mbedtls'
brew 'mpdecimal'
brew 'mpg123'
brew 'nettle'
brew 'node'
brew 'opencore-amr'
brew 'openexr'
brew 'openjpeg'
brew 'openssl@3'
brew 'opus'
brew 'p11-kit'
brew 'p7zip'
brew 'pango'
brew 'pcre2'
brew 'pipx'
brew 'pixman'
brew 'postgresql@16'
brew 'pycparser'
brew 'python-packaging'
brew 'python@3.11'
brew 'python@3.12'
brew 'python@3.13'
brew 'rav1e'
brew 'readline'
brew 'rubberband'
brew 'ruff'
brew 'sdl2'
brew 'shared-mime-info'
brew 'snappy'
brew 'speex'
brew 'sqlite'
brew 'srt'
brew 'svt-av1'
brew 'tesseract'
brew 'theora'
brew 'tree'
brew 'unbound'
brew 'uv'
brew 'wakeonlan'
brew 'webp'
brew 'wget'
brew 'whisper-cpp'
brew 'x264'
brew 'x265'
brew 'xorgproto'
brew 'xvid'
brew 'xz'
brew 'zeromq'
brew 'zimg'
brew 'zstd'

tap 'homebrew/cask'
cask '1password'
cask 'adobe-acrobat-reader'
cask 'android-file-transfer'
cask 'balenaetcher'
cask 'bambu-studio'
cask 'beeper'
cask 'bettertouchtool'
cask 'cad-assistant'
cask 'creality-print'
cask 'devtoys'
cask 'discord'
cask 'docker'
cask 'font-biz-udgothic'
cask 'font-plemol-jp'
cask 'font-plemol-jp-hs'
cask 'font-plemol-jp-nf'
cask 'ghostty'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'google-drive'
cask 'inkscape'
cask 'iterm2'
cask 'jordanbaird-ice'
cask 'karabiner-elements'
cask 'librecad'
cask 'miniforge'
cask 'obs'
cask 'orcaslicer'
cask 'raspberry-pi-imager'
cask 'raycast'
cask 'scroll-reverser'
cask 'synology-drive'
cask 'visual-studio-code'
cask 'vivaldi'
cask 'vlc'
cask 'zoom'

tap 'homebrew/bundle'

tap 'homebrew/cask-fonts'

tap 'homebrew/services'

tap 'grishka/grishka'
cask 'neardrop'

tap 'rcmdnk/file'
brew 'brew-file'

# Other Homebrew packages
brew 'icu4c'

# Other Cask applications
cask 'font-plemol-jp-nfj'

# App Store applications
mas 'Amazon Kindle (7.27.1)', id: 302584613
mas 'LINE (9.6.1)', id: 539883307
mas 'Microsoft Excel (16.94)', id: 462058435
mas 'OneDrive (25.020.0202)', id: 823766827
mas 'PicGIF Lite (2.0.9)', id: 844918735
mas 'Slack (4.42.120)', id: 803453959
mas 'Tailscale (1.80.2)', id: 1475387142
